In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index_s = ['a','b','c','d','e']
ser = pd.Series([1,2,3,4,5], index=index_s)
ser[0], ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_5572\3412011199.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a']

(np.int64(1), np.int64(1))

In [7]:
# dictionary
ser2 = pd.Series([10, 'banana'])
dict_data = {'a':1,'b':2, 'c':3, 'd':4}

In [11]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])


population['서울']
population[['서울','부산']]

서울    9776
부산    2729
dtype: int64

In [ ]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [ ]:
# 숫자         
ser.iloc[0], ser,loc['a']

np.int64(1)

In [15]:
# 한꺼번에 표현하고 싶을 떄 dataframe을 쓴다
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [18]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [19]:
scientists.iloc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [21]:
scientists['Name']

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [24]:
scientists.index = ['Rosaline Franklin','William Gosset']

In [25]:
scientists.loc['Rosaline Franklin']

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: Rosaline Franklin, dtype: object

lioc[] : index locator  숫자를 넣어서 꺼내기 
loc[] : locator

In [31]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
df = pd.DataFrame(data, columns=['A', 'B', 'C'])

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [32]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [33]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [34]:
sci1.loc[0,'Name']

'Rosaline Franklin'

In [35]:
sci1.loc[0,'Occupation']

'Chemist'

In [37]:
sci1.to_csv('./data/scientist_1.csv')

In [38]:
#remove index
sci1.to_csv('./data/scientist_2.csv', index=False)

In [42]:
df = pd.read_csv("./data/scientist_2.csv")
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [ ]:
#판다스로 csv 파일 읽어오기 
df = pd.read_csv('./data/scientists.csv')

In [44]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [49]:
# pickle: 파이썬의 객체형을 저장
sci1.to_pickle('./data/scientists.pickle')

In [51]:
#pickle은 피클로 읽어 함
df2 = pd.read_pickle('./data/scientists.pickle')

In [53]:
df1=df

In [ ]:
df.info()
#null/non-null, type 중요

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

# 데이터 미리보기

info()   
head/tail()

In [ ]:
#head 함수 기본 5개 
# (숫자) _ 안에 숫자 넣어서 조정 
df.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [ ]:
# 기술 통계를 낼 수 있는 column들만 뽑아서 

df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [62]:
df1.loc[:,'Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [63]:
# 데이터 프레임 생성 
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}

df_scores = pd.DataFrame(data)

In [66]:
df_scores.head(), df_scores.tail()

(    이름  나이  점수
 0  김철수  25  85
 1  이영희  28  92
 2  박민수  22  78
 3  정수진  31  95
 4  최영호  27  88,
     이름  나이  점수
 2  박민수  22  78
 3  정수진  31  95
 4  최영호  27  88
 5  한미래  24  73
 6  윤지원  29  91)

In [72]:

# 행/열 이름 바꾸기 

df_scores.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']

df_scores.columns = ['name', 'age', 'score']

df_scores

# 일부만 바꾸기 .rename()
df_scores.rename(columns={'이름': 'name', '나이': 'age', '점수': 'score'})
df_scores.rename(index={"A":"a", "B": "b"})
df_scores

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [73]:
df1.shape

(8, 5)